#include <stdint.h> 
#include <unistd.h> 
#include <stdio.h> 
#include <stdlib.h> 
#include <string.h>
#include <getopt.h> 
#include <fcntl.h> 
#include <sys/ioctl.h> 
#include <sys/mman.h> 
#include <linux/types.h> 
#include <linux/spi/spidev.h> 
#include <sys/times.h> 
#include <time.h>
#include <math.h>
#include "dmpKey.h"
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "dmpmap.h"

#include <linux/poll.h>
#include <sys/epoll.h>
#include <errno.h> 
#include <sys/signal.h>
#define ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0])) 

#define SPI_DISABLE (1)
 
#define SPI_AT_CPHA  0x02          /* clock phase */
#define SPI_AT_CPOL  0x01          /* clock polarity */
#define SPI_AT_MODE_0  (0|0)            /* (original MicroWire) */
#define SPI_AT_MODE_1  (0|SPI_AT_CPHA)
#define SPI_AT_MODE_2  (SPI_AT_CPOL|0)
#define SPI_AT_MODE_3  (SPI_AT_CPOL|SPI_AT_CPHA)
#define SPI_CS_HIGH 0x04          /* chipselect active high? */
#define SPI_LSB_FIRST 0x08          /* per-word bits-on-wire */
#define SPI_3WIRE 0x10          /* SI/SO signals shared */
#define SPI_LOOP  0x20          /* loopback mode */
#define SPI_NO_CS 0x40          /* 1 dev/bus, no chipselect */
#define SPI_READY 0x80          /* slave pulls low to pause */
#define SPI_TX_DUAL 0x100         /* transmit with 2 wires */
#define SPI_TX_QUAD 0x200         /* transmit with 4 wires */
#define SPI_RX_DUAL 0x400         /* receive with 2 wires */

#define EPOLLLT (0)
#define USB_SAVE_RESULT (1)

#define CBW_CMD_SEND_OPCODE   0x11
#define CBW_CMD_START_SCAN    0x12
#define CBW_CMD_READY   0x08
#define  OP_POWER_ON         0x01
#define  OP_QUERY            0x02
#define  OP_READY             0x03
#define  OP_SINGLE           0x04
#define  OP_DUPLEX           0x05
#define  OP_ACTION          0x06
//#define  OP_FIH               0x07
#define  OP_SEND_BACK        0x08
#define  OP_Multi_Single     0x09
#define  OP_Multi_DUPLEX     0x0A
#define  OP_Hand_Scan       0x0B
#define  OP_Note_Scan         0x0C
#define  OP_Multi_Hand_Scan  0x0D
#define  OP_META             0x4C
#define OP_META_Sub0      0x0
#define OP_META_Sub1      0x1
#define  OPSUB_WiFi_only      0x01
#define  OPSUB_SD_only       0x02
#define  OPSUB_WiFi_SD       0x03
#define OPSUB_WBC_Proc    0x84
#define  OPSUB_USB_Scan    0x85
#define  OPSUB_DualStream_WiFi_only  0x86
#define  OPSUB_DualStream_SD_only   0x87
#define  OPSUB_Hand_Scan     0x89
#define  OPSUB_Enc_Dec_Test   0x8A

#define MIN_SECTOR_SIZE  (512)
#define RING_BUFF_NUM   (2000)//(6000/4) //(1024)
#define DATA_RX_SIZE RING_BUFF_NUM

#define SPI_TRUNK_SZ 32768
#define TRUNK_SIZE SPI_TRUNK_SZ

#define OP_PON 0x1
#define OP_QRY 0x2
#define OP_RDY 0x3
#define OP_DAT 0x4
#define OP_SCM 0x5
#define OP_DCM 0x6
#define OP_FIH  0x7
#define OP_DUL 0x8
#define OP_SDRD 0x9
#define OP_SDWT 0xa
#define OP_SDAT 0xb
#define OP_RGRD 0xc
#define OP_RGWT 0xd
#define OP_RGDAT 0xe

#define OP_MAX 0xff
#define OP_NONE 0x00

#define OP_STSEC_0  0x10
#define OP_STSEC_1  0x11
#define OP_STSEC_2  0x12
#define OP_STSEC_3  0x13
#define OP_STLEN_0  0x14
#define OP_STLEN_1  0x15
#define OP_STLEN_2  0x16
#define OP_STLEN_3  0x17
#define OP_RGADD_H  0x18
#define OP_RGADD_L  0x19

#define OP_FFORMAT      0x20
#define OP_COLRMOD      0x21
#define OP_COMPRAT      0x22
#define OP_SCANMOD      0x23
#define OP_DATPATH      0x24
#define OP_RESOLTN       0x25
#define OP_SCANGAV       0x26
#define OP_MAXWIDH      0x27
#define OP_WIDTHAD_H   0x28
#define OP_WIDTHAD_L   0x29
#define OP_SCANLEN_H    0x2a
#define OP_SCANLEN_L    0x2b
#define OP_INTERIMG      0x2c

#define OP_SUP               0x31
#define OP_SAVE             0x32

/* usblp ioctls */
#define IOCNR_CONTI_READ_START  8
#define IOCNR_CONTI_READ_STOP    9
#define IOCNR_CONTI_READ_PROBE    10

/* Data requested by client. */
#define PRINT_ACCEL     (0x01)
#define PRINT_GYRO      (0x02)
#define PRINT_QUAT      (0x04)

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)

#define MPU9250
#define MPU6500
#define AK8963_SECONDARY
//#define AK89xx_SECONDARY

/*
#define INV_X_GYRO      (0x40)
#define INV_Y_GYRO      (0x20)
#define INV_Z_GYRO      (0x10)
#define INV_XYZ_GYRO    (INV_X_GYRO | INV_Y_GYRO | INV_Z_GYRO)
#define INV_XYZ_ACCEL   (0x08)
#define INV_XYZ_COMPASS (0x01)
*/
#define CALAB_DATA_BUFF_SIZE  (2048)

static int *totSalloc=0;

struct intMbs_s{
    union {
        uint32_t n;
        uint8_t d[4];
    };
};

struct aspMetaData_s{
  struct intMbs_s     FUNC_BITS;             // byte[4] 
  unsigned char  ASP_MAGIC[2];            //byte[6] "0x20 0x14"
  
  /* ASPMETA_FUNC_CONF = 0x1 */       /* 0b00000001 */
  unsigned char  FILE_FORMAT;             //0x31
  unsigned char  COLOR_MODE;              //0x32
  unsigned char  COMPRESSION_RATE;        //0x33
  unsigned char  RESOLUTION;              //0x34
  unsigned char  SCAN_GRAVITY;            //0x35
  unsigned char  CIS_MAX_WIDTH;           //0x36
  unsigned char  WIDTH_ADJUST_H;          //0x37
  unsigned char  WIDTH_ADJUST_L;          //0x38
  unsigned char  SCAN_LENGTH_H;           //0x39
  unsigned char  SCAN_LENGTH_L;           //0x3a
  unsigned char  INTERNAL_IMG;             //0x3b
  unsigned char  AFE_IC_SELEC;             //0x3c
  unsigned char  EXTNAL_PULSE;            //0x3d
  unsigned char  SUP_WRITEBK;             //0x3e
  unsigned char  OP_FUNC_00;               //0x70
  unsigned char  OP_FUNC_01;               //0x71
  unsigned char  OP_FUNC_02;               //0x72
  unsigned char  OP_FUNC_03;               //0x73
  unsigned char  OP_FUNC_04;               //0x74
  unsigned char  OP_FUNC_05;               //0x75
  unsigned char  OP_FUNC_06;               //0x76
  unsigned char  OP_FUNC_07;               //0x77
  unsigned char  OP_FUNC_08;               //0x78
  unsigned char  OP_FUNC_09;               //0x79
  unsigned char  OP_FUNC_10;               //0x7A
  unsigned char  OP_FUNC_11;               //0x7B
  unsigned char  OP_FUNC_12;               //0x7C
  unsigned char  OP_FUNC_13;               //0x7D
  unsigned char  OP_FUNC_14;               //0x7E
  unsigned char  OP_FUNC_15;               //0x7F  
  unsigned char  BLEEDTHROU_ADJUST; //0x81
  unsigned char  BLACKWHITE_THSHLD; //0x82  
  unsigned char  SD_CLK_RATE_16;        //0x83    
  unsigned char  PAPER_SIZE;                //0x84  
  unsigned char  JPGRATE_ENG_17;       //0x85  
  unsigned char  OP_FUNC_18;               //0x86  
  unsigned char  OP_FUNC_19;               //0x87  
  unsigned char  OP_FUNC_20;               //0x88  
  unsigned char  OP_RESERVE[20];          // byte[64]
  
  /* ASPMETA_FUNC_CROP = 0x2 */       /* 0b00000010 */
  struct intMbs_s CROP_POS_1;        //byte[68]
  struct intMbs_s CROP_POS_2;        //byte[72]
  struct intMbs_s CROP_POS_3;        //byte[76]
  struct intMbs_s CROP_POS_4;        //byte[80]
  struct intMbs_s CROP_POS_5;        //byte[84]
  struct intMbs_s CROP_POS_6;        //byte[88]
  struct intMbs_s CROP_POS_7;        //byte[92]
  struct intMbs_s CROP_POS_8;        //byte[96]
  struct intMbs_s CROP_POS_9;        //byte[100]
  struct intMbs_s CROP_POS_10;        //byte[104]
  struct intMbs_s CROP_POS_11;        //byte[108]
  struct intMbs_s CROP_POS_12;        //byte[112]
  struct intMbs_s CROP_POS_13;        //byte[116]
  struct intMbs_s CROP_POS_14;        //byte[120]
  struct intMbs_s CROP_POS_15;        //byte[124]
  struct intMbs_s CROP_POS_16;        //byte[128]
