#include <stdint.h> 
#include <unistd.h> 
#include <stdio.h> 
#include <stdlib.h> 
#include <string.h>
//#include <getopt.h> 
#include <fcntl.h> 
#include <sys/ioctl.h> 
#include <sys/mman.h> 
#include <sys/epoll.h>
#include <linux/types.h> 
#include <linux/spi/spidev.h> 
//#include <sys/times.h> 
#include <time.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>

#include <dirent.h>
#include <sys/stat.h>  
#include <netdb.h>
#include <ifaddrs.h>
#include <math.h>
#include <errno.h> 
//#include <mysql.h>
//main()
#define MSP_VERSION " Tue Jun 13 11:19:35 2017 ecb1639f79 [MSP] reverse y for raw v3, fix algo issue print mass points, fix cropping issue"

#define SPI1_ENABLE (1) 

#if SPI1_ENABLE
#define SPIDEV_SWITCH (0)
#else // spidev switch must be disable
#define SPIDEV_SWITCH (0)
#endif

#define LOG_ALL_DISABLE (0)

#define MIN_SECTOR_SIZE (512)
#define RING_BUFF_NUM (64)

#define PULL_LOW_AFTER_DATA (0)

#define SPI_CPHA  0x01          /* clock phase */
#define SPI_CPOL  0x02          /* clock polarity */
#define SPI_MODE_0      (0|0)
#define SPI_MODE_1      (0|SPI_CPHA)
#define SPI_MODE_2      (SPI_CPOL|0)
#define SPI_MODE_3      (SPI_CPOL|SPI_CPHA)
#if SPI1_ENABLE
static char spidev_1[] = "/dev/spidev32766.0"; 
#else //#if SPI1_ENABLE
static char *spidev_1 = 0;
#endif //#if SPI1_ENABLE
static char spidev_0[] = "/dev/spidev32765.0"; 
static int *asptotMalloc=0;
static int *totSalloc=0;
//static char netIntfs[16] = "uap0";
    
/* flow operation */

    ASPOP_CROP_17,
    ASPOP_CROP_18,
    ASPOP_CROP_COOR_XH,
    ASPOP_CROP_COOR_XL,
    ASPOP_CROP_COOR_YH, /* 90 */
    ASPOP_CROP_COOR_YL,
    ASPOP_EG_DECT,
    ASPOP_AP_MODE,
    ASPOP_XCROP_GAT,
    ASPOP_XCROP_LINSTR,
    ASPOP_XCROP_LINREC,
    ASPOP_RAW_SIZE,
    ASPOP_CROP_01_DUO,
    ASPOP_CROP_02_DUO, 
    ASPOP_CROP_03_DUO,
    ASPOP_CROP_04_DUO,   /* 100 */
    ASPOP_CROP_05_DUO,
    ASPOP_CROP_06_DUO,
    ASPOP_IMG_LEN_DUO, /* must be here for old design */
    ASPOP_CROP_07_DUO,
    ASPOP_CROP_08_DUO,
    ASPOP_CROP_09_DUO,
    ASPOP_CROP_10_DUO,
    ASPOP_CROP_11_DUO, 
    ASPOP_CROP_12_DUO,
    ASPOP_CROP_13_DUO,  /* 110 */
    ASPOP_CROP_14_DUO,
    ASPOP_CROP_15_DUO,
    ASPOP_CROP_16_DUO,
    ASPOP_CROP_17_DUO,
    ASPOP_CROP_18_DUO,
    ASPOP_XCROP_GAT_DUO,
    ASPOP_XCROP_LINSTR_DUO,
    ASPOP_XCROP_LINREC_DUO,
    ASPOP_RAW_SIZE_DUO,
    ASPOP_CODE_MAX, /* 119 */
} aspOpCode_e;

typedef enum {
    ASPOP_MASK_0 = 0x0,
    ASPOP_MASK_1 = 0x1,
    ASPOP_MASK_2 = 0x3,
    ASPOP_MASK_3 = 0x7,
    ASPOP_MASK_4 = 0xf,
    ASPOP_MASK_5 = 0x1f,
    ASPOP_MASK_6 = 0x3f,
    ASPOP_MASK_7 = 0x7f,
    ASPOP_MASK_8 = 0xff,
    ASPOP_MASK_16 = 0xffff,
    ASPOP_MASK_32 = 0xffffffff,
} aspOpMask_e;

typedef enum {
    ASPOP_TYPE_NONE = 0,
    ASPOP_TYPE_SINGLE,
    ASPOP_TYPE_MULTI,
    ASPOP_TYPE_VALUE,
} aspOpType_e;

typedef enum {
    SINSCAN_NONE=0,
    SINSCAN_WIFI_ONLY,
    SINSCAN_SD_ONLY,
    SINSCAN_WIFI_SD,
    SINSCAN_WHIT_BLNC,
    SINSCAN_USB,
    SINSCAN_DUAL_STRM,
    SINSCAN_DUAL_SD,
} singleScan_e;

typedef enum {
    DOUSCAN_NONE=0,
    DOUSCAN_WIFI_ONLY,
    DOUSCAN_WIFI_SD,
    DOUSCAN_WHIT_BLNC,
} doubleScan_e;

typedef enum {
    SUPBACK_NONE=0,
    SUPBACK_SD,
    SUPBACK_RAW,
    SUPBACK_FAT,
} supBack_e;

typedef enum {
    ACTION_NONE=0,
    ACTION_OPTION_01,
    ACTION_OPTION_02,
    ACTION_OPTION_03,
    ACTION_OPTION_04,
    ACTION_OPTION_05,
} actOption_e;

typedef enum {
    FILE_FORMAT_NONE=0,
    FILE_FORMAT_JPG,
    FILE_FORMAT_PDF,
    FILE_FORMAT_RAW,
    FILE_FORMAT_TIFF_I,
    FILE_FORMAT_TIFF_M,
} fileFormat_e;

typedef enum {
    COLOR_MODE_NONE=0,
    COLOR_MODE_COLOR,
    COLOR_MODE_GRAY,
    COLOR_MODE_GRAY_DETAIL,
    COLOR_MODE_BLACKWHITE,
} colorMode_e;

typedef enum {
    RESOLUTION_NONE=0,
    RESOLUTION_1200,
    RESOLUTION_600,
    RESOLUTION_300, 
    RESOLUTION_200, 
    RESOLUTION_150, 
} resolution_e;

typedef enum {
    DEFAULTWIDTH_NONE=0,
    DEFAULTWIDTH_1 = 1,//7000,
    DEFAULTWIDTH_2 = 2,//5184,
    DEFAULTWIDTH_3 = 3,//5120,
    DEFAULTWIDTH_4 = 4,//4856,
    DEFAULTWIDTH_5 = 5,//4320,
    DEFAULTWIDTH_FROM_NUM,
} defaultWidthTag_e;

typedef enum {
    DEFAULTWIDTH_VALNON=0,
    DEFAULTWIDTH_VAL1 = 7000,
    DEFAULTWIDTH_VAL2 = 5184,
    DEFAULTWIDTH_VAL3 = 5120,
    DEFAULTWIDTH_VAL4 = 4856,
    DEFAULTWIDTH_VAL5 = 4320,
} defaultWidthValue_e;

typedef enum {
    SDSTATS_ERROR=0,
    SDSTATS_OK,
} SDStatus_e;

typedef enum {
    APM_NONE=0,
    APM_AP,
    APM_DIRECT,
} APMode_e;

struct aspMemAsign_s{
    uint32_t aspMemSize[ASP_MEM_SLOT_NUM];
    uint32_t aspMemAddr[ASP_MEM_SLOT_NUM];
};

struct aspInfoSplit_s{
    char *infoStr;
    int     infoLen;
    struct aspInfoSplit_s *n;
};

struct aspWaitRlt_s{
    char *wtRlt; /* size == 16bytes */
    int  wtMs;
    int  wtComp;
    int  wtChan;
    struct mainRes_s *wtMrs;
};

struct aspConfig_s{
    uint32_t opStatus;
    uint32_t opCode;
    uint32_t opValue;
    uint32_t opMask;
    uint32_t opType;
    uint32_t opBitlen;
};

typedef enum {
    ASPFS_ATTR_READ_ONLY = 0x01,
    ASPFS_ATTR_HIDDEN = 0x02,
    ASPFS_ATTR_SYSTEM = 0x04,
    ASPFS_ATTR_VOLUME_ID = 0x08,
    ASPFS_ATTR_DIRECTORY = 0x10,
    ASPFS_ATTR_ARCHIVE = 0x20,
} aspFSattribute_e;

typedef enum {
    ASPFS_STATUS_NONE = 0,
    ASPFS_STATUS_ING,
    ASPFS_STATUS_EN,
    ASPFS_STATUS_DIS,
} aspFSstatus_e;

typedef enum {
    ASPMETA_POWON_INIT = 0,
    ASPMETA_SCAN_GO = 1,
    ASPMETA_SCAN_COMPLETE = 2,
    ASPMETA_CROP_300DPI = 3,
    ASPMETA_CROP_600DPI = 4,
    ASPMETA_SCAN_COMPLE_DUO = 5,
    ASPMETA_CROP_300DPI_DUO = 6,
    ASPMETA_CROP_600DPI_DUO = 7,
    ASPMETA_SD = 8,
} aspMetaParam_e;

typedef enum {
    ASPMETA_INPUT = 0,
    ASPMETA_OUTPUT = 1,
} aspMetaInoutFlag_e;

typedef enum {
    ASPMETA_FUNC_NONE = 0,
    ASPMETA_FUNC_CONF = 0b00000001,
    ASPMETA_FUNC_CROP = 0b00000010,
    ASPMETA_FUNC_IMGLEN = 0b00000100,
    ASPMETA_FUNC_SDFREE = 0b00001000,
    ASPMETA_FUNC_SDUSED = 0b00010000,
    ASPMETA_FUNC_SDRD = 0b00100000,
    ASPMETA_FUNC_SDWT = 0b01000000,
} aspMetaFuncbit_e;

struct apWifiConfig_s{
    char wfssid[36];
    int wfsidLen;
    char wfpsk[64];
    int wfpskLen;
};

struct supdataBack_s{
    struct supdataBack_s   *n;
    int supdataTot;
    int supdataUse;
    char supdataBuff[SPI_TRUNK_SZ];
};

struct directnFile_s{
    uint32_t   dftype;
    uint32_t   dfstats;
    char        dfLFN[256];
    char        dfSFN[12];
    int           dflen;
    uint32_t   dfattrib;
    uint32_t   dfcretime;
    uint32_t   dfcredate;
    uint32_t   dflstacdate;
    uint32_t   dfrecotime;
    uint32_t   dfrecodate;
    uint32_t   dfclstnum;
    uint32_t   dflength;
    struct directnFile_s *pa;
    uint32_t   dfpaid;
    struct directnFile_s *br;
    uint32_t   dfbrid;
    struct directnFile_s *ch;   
    uint32_t   dfchid;
    
    struct adFATLinkList_s *fln;
    uint32_t   dfindex;
};

struct folderQueue_s{
    struct directnFile_s *fdObj;
    struct folderQueue_s *fdnxt;
};

struct pipe_s{
    int rt[2];
};

typedef enum {
    ASPFAT_STATUS_INIT = 0x1,
    ASPFAT_STATUS_BOOT_SEC = 0x2,
    ASPFAT_STATUS_FS_INFO = 0x4,
    ASPFAT_STATUS_FAT = 0x8,
    ASPFAT_STATUS_ROOT_DIR = 0x10,
    ASPFAT_STATUS_FOLDER = 0x20,
    ASPFAT_STATUS_SDRD = 0x40,
    ASPFAT_STATUS_SDWT = 0x80,
    ASPFAT_STATUS_FATWT = 0x100,
    ASPFAT_STATUS_DFEWT = 0x200,
    ASPFAT_STATUS_BOOT = 0x400,
    ASPFAT_STATUS_DFECHK = 0x800,
    ASPFAT_STATUS_DFERD = 0x1000,
    ASPFAT_STATUS_SDWBK = 0x2000,
} aspFatStatus_e;


struct sdRaw_s{
    char rowBP[512];
};

struct sdbootsec_s{
    int secSt;              // status of boot sector 
    int secJpcmd;      // jump command to the boot program
    char secSysid[8];
    int secSize;          // 512
    int secPrClst;       // 4 8 16 32 64
    int secResv;        // M 
    int secNfat;         // should be 2
    int secTotal;        // total sectors
    int secIDm;         // must be 0xF8
    int secPrfat;         // sectors per FAT
    int secPrtrk;         // sectors per track
    int secNsid;          // number of sides
    int secNhid;          // number of hidden sectors
    int secExtf;           // extension flag, specify the status of FAT mirroring
    int secVers;          // File system version
    int secRtclst;        // indicate the cluster number of root dir
    int secFSif;           // indicate the sector number of FS info, will be 1 normally
    int secBkbt;          // indicate the offset sector number of backup boot sector
    int secPhdk;         // pyhsical disk number, should be 0x80
    int secExtbt;        // extended boot record signature, should be 0x29
    int secVoid;          // volume ID number
    char secVola[12]; // volume label
    char secFtyp[12];   // file system type in ascii
    int secSign;          // shall be 0x55 (BP510) and 0xAA (BP511)
    int secWhfat;        // indicate the sector of fat table
    int secWhroot;      // indicate the sector of root dir
    int secBoffset;
};

struct sdFSinfo_s{
    int finLdsn;            // lead ingnature, shall be 0x52 0x52 0x61 0x41
    int finStsn;             // structure signature, shall be 0x72 0x72 0x41 0x61
    int finFreClst;        // free cluster count
    int finNxtFreClst;   // next free cluster
    int finTrsn;             // shall be 0x00 0x00 0x55 0xaa
};

struct adFATSpaceInfo_s{
    uint32_t  ftfreeClst;
    uint32_t  ftusedClst;
    struct adFATLinkList_s *f;    
};

struct adFATLinkList_s{
    uint32_t ftStart;              // start cluster
    uint32_t ftLen;                // cluster length
    struct adFATLinkList_s *n;    
};

struct sdFATable_s{
    uint8_t *ftbFat1;
    uint32_t ftbLen;
    struct adFATLinkList_s *h;
    struct adFATLinkList_s *c;
    struct adFATSpaceInfo_s ftbMng;
};

struct sdParseBuff_s{
    int dirBuffMax;
    int dirBuffUsed;
    char *dirParseBuff;
};

struct sdDirPool_s{
    int dirMax;
    int dirUsed;
    struct directnFile_s   dirPool[FAT_DIRPOOL_IDX_MAX];
};

struct sdFatDir_s{
    int dirFATMax;
    int dirFATUsed;
    int dirFATDirty;
    struct sdDirPool_s      *fatDirPool[FAT_DIRPOO_ARY_MAX];
    struct directnFile_s     *dirCur;
    struct directnFile_s     *dirRoot;
};

struct sdFAT_s{
    int fatStatus;
    int fatRetry;
    struct directnFile_s     fatFileDnld;
    struct directnFile_s     fatFileUpld;
    struct directnFile_s     fatCurDir;
    struct directnFile_s     fatRootdir;
    struct sdbootsec_s     *fatBootsec;
    struct sdFSinfo_s        *fatFSinfo;
    struct sdFATable_s      *fatTable;
    struct sdFatDir_s         fatDirTr;
    struct sdParseBuff_s  parBuf;
    struct supdataBack_s    *fatSupdata;
    struct supdataBack_s    *fatSupcur;
    struct supdataBack_s    *fatSupdataDuo;
    struct supdataBack_s    *fatSupcurDuo;
};

struct psdata_s {
    uint32_t bkofw;
    uint32_t result;
    uint32_t ansp0;
    struct procRes_s *rs;
};

typedef int (*stfunc)(struct psdata_s *data);

struct logPool_s{
    char *pool;
    char *cur;
    int max;
    int len;
    uint32_t dislog;
};

struct cmd_s{
    int  id;
    char str[16];
    func pfunc;
};

struct ring_s{
    int run;
    int seq;
};

struct ring_p{
    struct ring_s lead;
    struct ring_s dual;
    struct ring_s prelead;
    struct ring_s predual;
    struct ring_s folw;
    struct ring_s psudo;
};

struct socket_s{
    int listenfd;
    int connfd;
    struct sockaddr_in serv_addr; 
    struct sockaddr_in clint_addr; 
    struct addrinfo addr_in;
};

struct shmem_s{
    int totsz;
    int chksz;
    int slotn;
    char **pp;
    int svdist;
    struct ring_p *r;
    int lastflg;
    int lastsz;
    int dualsz; 
};

struct modersp_s{
    int m;
    int r;
    int d;
    int v;  
    int c;
};

struct info16Bit_s{
    uint8_t     inout;
    uint8_t     seqnum;
    uint8_t     opcode;
    uint8_t     data;
    uint32_t   opinfo;
};

struct machineCtrl_s{
    uint32_t seqcnt;
    struct info16Bit_s tmp;
    struct info16Bit_s cur;
    struct info16Bit_s get;
    struct modersp_s mch;
};

struct intMbs_s{
    union {
        uint32_t n;
        uint8_t d[4];
    };
};

struct aspMetaData_s{
  struct intMbs_s     FUNC_BITS;             // byte[4] 
  unsigned char  ASP_MAGIC[2];            //byte[6] "0x20 0x14"
  
  /* ASPMETA_FUNC_CONF = 0x1 */       /* 0b00000001 */
  unsigned char  FILE_FORMAT;             //0x31
  unsigned char  COLOR_MODE;              //0x32
  unsigned char  COMPRESSION_RATE;        //0x33
  unsigned char  RESOLUTION;              //0x34
  unsigned char  SCAN_GRAVITY;            //0x35
  unsigned char  CIS_MAX_WIDTH;           //0x36
  unsigned char  WIDTH_ADJUST_H;          //0x37
  unsigned char  WIDTH_ADJUST_L;          //0x38
  unsigned char  SCAN_LENGTH_H;           //0x39
  unsigned char  SCAN_LENGTH_L;           //0x3a
  unsigned char  INTERNAL_IMG;            //0x3b
  unsigned char  AFE_IC_SELEC;            //0x3c
  unsigned char  EXTNAL_PULSE;            //0x3d
  unsigned char  SUP_WRITEBK;             //0x3e
  unsigned char  OP_FUNC_00;              //0x70
  unsigned char  OP_FUNC_01;              //0x71
  unsigned char  OP_FUNC_02;              //0x72
  unsigned char  OP_FUNC_03;              //0x73
  unsigned char  OP_FUNC_04;              //0x74
  unsigned char  OP_FUNC_05;              //0x75
  unsigned char  OP_FUNC_06;              //0x76
  unsigned char  OP_FUNC_07;              //0x77
  unsigned char  OP_FUNC_08;              //0x78
  unsigned char  OP_FUNC_09;              //0x79
  unsigned char  OP_FUNC_10;              //0x7A
  unsigned char  OP_FUNC_11;              //0x7B
  unsigned char  OP_FUNC_12;              //0x7C
  unsigned char  OP_FUNC_13;              //0x7D
  unsigned char  OP_FUNC_14;              //0x7E
  unsigned char  OP_FUNC_15;              //0x7F  
  unsigned char  OP_RESERVE[28];          // byte[64]
  
  /* ASPMETA_FUNC_CROP = 0x2 */       /* 0b00000010 */
  struct intMbs_s CROP_POS_1;        //byte[68]
  struct intMbs_s CROP_POS_2;        //byte[72]
  struct intMbs_s CROP_POS_3;        //byte[76]
  struct intMbs_s CROP_POS_4;        //byte[80]
  struct intMbs_s CROP_POS_5;        //byte[84]
  struct intMbs_s CROP_POS_6;        //byte[88]
  struct intMbs_s CROP_POS_7;        //byte[92]
  struct intMbs_s CROP_POS_8;        //byte[96]
  struct intMbs_s CROP_POS_9;        //byte[100]
  struct intMbs_s CROP_POS_10;        //byte[104]
  struct intMbs_s CROP_POS_11;        //byte[108]
  struct intMbs_s CROP_POS_12;        //byte[112]
  struct intMbs_s CROP_POS_13;        //byte[116]
  struct intMbs_s CROP_POS_14;        //byte[120]
  struct intMbs_s CROP_POS_15;        //byte[124]
  struct intMbs_s CROP_POS_16;        //byte[128]
  struct intMbs_s CROP_POS_17;        //byte[132]
