#include <stdint.h> 
#include <unistd.h> 
#include <stdio.h> 
#include <stdlib.h> 
#include <string.h>
//#include <getopt.h> 
#include <fcntl.h> 
#include <sys/ioctl.h> 
#include <sys/mman.h> 
#include <sys/epoll.h>
#include <sys/prctl.h>
#include <sys/sysinfo.h> 
#include <sys/types.h>
#include <linux/types.h> 
#include <linux/spi/spidev.h> 
//#include <sys/times.h> 
#include <time.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <linux/poll.h>

#include <dirent.h>
#include <sys/stat.h>  
#include <netdb.h>
#include <ifaddrs.h>
#include <linux/if_link.h>
#include <math.h>
#include <errno.h> 
//#include <mysql.h>
//main()
#define MSP_VERSION "Wed Jan 16 09:44:59 2019 \
7ddfc66117"


#define DISABLE_SPI  (1)
#define DISABLE_USB  (0)
#define SPI1_ENABLE (1) 

#if SPI1_ENABLE
#define SPIDEV_SWITCH (0)
#else // spidev switch must be disable
#define SPIDEV_SWITCH (0)
#endif

#define LOG_ALL_DISABLE (0)

#define ONLY_ONE_USB (1)
#if DISABLE_USB
#define USB_META (0)
#define MOVE_MUTX_TO_FRONT_P6  (0)
#else
#define USB_META (1)
#define MOVE_MUTX_TO_FRONT_P6  (1)
#endif
#define MIN_SECTOR_SIZE (512)
#define RING_BUFF_NUM (64)
//#define RING_BUFF_NUM_USB   (1728)//(1728)//(1330)//(1536)
#define RING_BUFF_NUM_USB   (3200) //(1536) (3200)
#define USB_BUF_SIZE (65536) //(98304) (65536)
#define USB_META_SIZE 512
#define TABLE_SLOT_SIZE 4
#define CYCLE_LEN (40)
#define USB_CALLBACK_LOOP (1)
#define DBG_DUMP_DAT32  (0)

    ASPOP_CROP_04_DUO,   /* 100 */
    ASPOP_CROP_05_DUO,
    ASPOP_CROP_06_DUO,
    ASPOP_IMG_LEN_DUO, /* must be here for old design */
    ASPOP_CROP_07_DUO,
    ASPOP_CROP_08_DUO,
    ASPOP_CROP_09_DUO,
    ASPOP_CROP_10_DUO,
    ASPOP_CROP_11_DUO, 
    ASPOP_CROP_12_DUO,
    ASPOP_CROP_13_DUO,  /* 110 */
    ASPOP_CROP_14_DUO,
    ASPOP_CROP_15_DUO,
    ASPOP_CROP_16_DUO,
    ASPOP_CROP_17_DUO,
    ASPOP_CROP_18_DUO,
    ASPOP_XCROP_GAT_DUO,
    ASPOP_XCROP_LINSTR_DUO,
    ASPOP_XCROP_LINREC_DUO,
    ASPOP_RAW_SIZE_DUO,
    ASPOP_MULTI_LOOP,
    ASPOP_SCAN_STATUS,
    ASPOP_SCAN_STATUS_DUO,
    ASPOP_SCAN_WIDTH,
    ASPOP_SCAN_WIDTH_DUO,
    ASPOP_CODE_MAX, /* 121 */
} aspOpCode_e;

typedef enum {
    ASPOP_MASK_0 = 0x0,
    ASPOP_MASK_1 = 0x1,
    ASPOP_MASK_2 = 0x3,
    ASPOP_MASK_3 = 0x7,
    ASPOP_MASK_4 = 0xf,
    ASPOP_MASK_5 = 0x1f,
    ASPOP_MASK_6 = 0x3f,
    ASPOP_MASK_7 = 0x7f,
    ASPOP_MASK_8 = 0xff,
    ASPOP_MASK_16 = 0xffff,
    ASPOP_MASK_32 = 0xffffffff,
} aspOpMask_e;

typedef enum {
    ASPOP_TYPE_NONE = 0,
    ASPOP_TYPE_SINGLE,
    ASPOP_TYPE_MULTI,
    ASPOP_TYPE_VALUE,
} aspOpType_e;

typedef enum {
    SINSCAN_NONE=0,
    SINSCAN_WIFI_ONLY,
    SINSCAN_SD_ONLY,
    SINSCAN_WIFI_SD,
    SINSCAN_WHIT_BLNC,
    SINSCAN_USB,
    SINSCAN_DUAL_STRM,
    SINSCAN_DUAL_SD,
} singleScan_e;

typedef enum {
    DOUSCAN_NONE=0,
    DOUSCAN_WIFI_ONLY,
    DOUSCAN_SD_ONLY,
    DOUSCAN_WIFI_SD,
} doubleScan_e;

typedef enum {
    NOTESCAN_NONE=0,
    NOTESCAN_OPTION_01,
    NOTESCAN_OPTION_02,
    NOTESCAN_OPTION_03,
    NOTESCAN_OPTION_04,
    NOTESCAN_OPTION_05,
    NOTESCAN_OPTION_06,
    NOTESCAN_OPTION_07,
} noteScan_e;

typedef enum {
    SUPBACK_NONE=0,
    SUPBACK_SD,
    SUPBACK_RAW,
    SUPBACK_FAT,
} supBack_e;

typedef enum {
    ACTION_NONE=0,
    ACTION_OPTION_01,
    ACTION_OPTION_02,
    ACTION_OPTION_03,
    ACTION_OPTION_04,
    ACTION_OPTION_05,
} actOption_e;

typedef enum {
    FILE_FORMAT_NONE=0,
    FILE_FORMAT_JPG,
    FILE_FORMAT_PDF,
    FILE_FORMAT_RAW,
    FILE_FORMAT_TIFF_I,
    FILE_FORMAT_TIFF_M,
} fileFormat_e;

typedef enum {
    COLOR_MODE_NONE=0,
    COLOR_MODE_COLOR,
    COLOR_MODE_GRAY,
    COLOR_MODE_GRAY_DETAIL,
    COLOR_MODE_BLACKWHITE,
} colorMode_e;

typedef enum {
    RESOLUTION_NONE=0,
    RESOLUTION_1200,
    RESOLUTION_600,
    RESOLUTION_300, 
    RESOLUTION_200, 
    RESOLUTION_150, 
} resolution_e;

typedef enum {
    DEFAULTWIDTH_NONE=0,
    DEFAULTWIDTH_1 = 1,//7000,
    DEFAULTWIDTH_2 = 2,//5184,
    DEFAULTWIDTH_3 = 3,//5120,
    DEFAULTWIDTH_4 = 4,//4856,
    DEFAULTWIDTH_5 = 5,//4320,
    DEFAULTWIDTH_FROM_NUM,
} defaultWidthTag_e;

typedef enum {
    DEFAULTWIDTH_VALNON=0,
    DEFAULTWIDTH_VAL1 = 7000,
    DEFAULTWIDTH_VAL2 = 5184,
    DEFAULTWIDTH_VAL3 = 5120,
    DEFAULTWIDTH_VAL4 = 4856,
    DEFAULTWIDTH_VAL5 = 4320,
} defaultWidthValue_e;

typedef enum {
    SDSTATS_ERROR=0,
    SDSTATS_OK,
} SDStatus_e;

typedef enum {
    APM_NONE=0,
    APM_AP,
    APM_DIRECT,
} APMode_e;

struct aspMemAsign_s{
    int aspMemSize[ASP_MEM_SLOT_NUM];
    uint32_t aspMemAddr[ASP_MEM_SLOT_NUM];
};

struct aspInfoSplit_s{
    char *infoStr;
    int     infoLen;
    struct aspInfoSplit_s *n;
};

struct aspWaitRlt_s{
    char *wtRlt; /* size == 16bytes */
    int  wtMs;
    int  wtComp;
    int  wtChan;
    struct mainRes_s *wtMrs;
};

struct aspConfig_s{
    uint32_t opStatus;
    uint32_t opCode;
    uint32_t opValue;
    uint32_t opMask;
    uint32_t opType;
    uint32_t opBitlen;
};

typedef enum {
    ASPFS_ATTR_READ_ONLY = 0x01,
    ASPFS_ATTR_HIDDEN = 0x02,
    ASPFS_ATTR_SYSTEM = 0x04,
    ASPFS_ATTR_VOLUME_ID = 0x08,
    ASPFS_ATTR_DIRECTORY = 0x10,
    ASPFS_ATTR_ARCHIVE = 0x20,
} aspFSattribute_e;

typedef enum {
    ASPFS_STATUS_NONE = 0,
    ASPFS_STATUS_ING,
    ASPFS_STATUS_EN,
    ASPFS_STATUS_DIS,
} aspFSstatus_e;

typedef enum {
    ASPMETA_POWON_INIT = 0,
    ASPMETA_SCAN_GO = 1,
    ASPMETA_SCAN_COMPLETE = 2,
    ASPMETA_CROP_300DPI = 3,
    ASPMETA_CROP_600DPI = 4,
    ASPMETA_SCAN_COMPLE_DUO = 5,
    ASPMETA_CROP_300DPI_DUO = 6,
    ASPMETA_CROP_600DPI_DUO = 7,
    ASPMETA_SD = 8,
    ASPMETA_OCR = 9,
} aspMetaParam_e;

typedef enum {
    ASPMETA_INPUT = 0,
    ASPMETA_OUTPUT = 1,
} aspMetaInoutFlag_e;

typedef enum {
    ASPMETA_FUNC_NONE = 0,
    ASPMETA_FUNC_CONF = 0b00000001,
    ASPMETA_FUNC_CROP = 0b00000010,
    ASPMETA_FUNC_IMGLEN = 0b00000100,
    ASPMETA_FUNC_SDFREE = 0b00001000,
    ASPMETA_FUNC_SDUSED = 0b00010000,
    ASPMETA_FUNC_SDRD = 0b00100000,
    ASPMETA_FUNC_SDWT = 0b01000000,
} aspMetaFuncbit_e;

struct apWifiConfig_s{
    char wfssid[36];
    int wfsidLen;
    char wfpsk[64];
    int wfpskLen;
};

struct supdataBack_s{
    struct supdataBack_s   *n;
    int supdataTot;
    int supdataUse;
    char supdataBuff[SPI_TRUNK_SZ];
};

struct directnFile_s{
    uint32_t   dftype;
    uint32_t   dfstats;
    char        dfLFN[256];
    char        dfSFN[12];
    uint16_t   dflen;
    uint16_t   dfattrib;
    uint32_t   dfcretime;
    uint32_t   dfcredate;
    uint32_t   dflstacdate;
    uint32_t   dfrecotime;
    uint32_t   dfrecodate;
    uint32_t   dfclstnum;
    uint32_t   dflength;
    struct directnFile_s *pa;
    uint32_t   dfpaid;
    struct directnFile_s *br;
    uint32_t   dfbrid;
    struct directnFile_s *ch;   
    uint32_t   dfchid;
    
    struct adFATLinkList_s *fln;
    uint32_t   dfindex;
};

struct folderQueue_s{
    struct directnFile_s *fdObj;
    struct folderQueue_s *fdnxt;
};

struct pipe_s{
    int rt[2];
};

typedef enum {
    ASPFAT_STATUS_INIT = 0x0,
    ASPFAT_STATUS_MBR = 0x1,
    ASPFAT_STATUS_BOOT_SEC = 0x2,
    ASPFAT_STATUS_FS_INFO = 0x4,
    ASPFAT_STATUS_FAT = 0x8,
    ASPFAT_STATUS_ROOT_DIR = 0x10,
    ASPFAT_STATUS_FOLDER = 0x20,
    ASPFAT_STATUS_SDRD = 0x40,
    ASPFAT_STATUS_SDWT = 0x80,
    ASPFAT_STATUS_FATWT = 0x100,
    ASPFAT_STATUS_DFEWT = 0x200,
    ASPFAT_STATUS_BOOT = 0x400,
    ASPFAT_STATUS_DFECHK = 0x800,
    ASPFAT_STATUS_DFERD = 0x1000,
    ASPFAT_STATUS_SDWBK = 0x2000,
    ASPFAT_STATUS_FMTBSEC = 0x4000,
    ASPFAT_STATUS_FMTFAT = 0x8000,
    ASPFAT_STATUS_FMTROOT = 0x10000,
    ASPFAT_STATUS_FOLDRWT = 0x20000,
} aspFatStatus_e;


struct sdRaw_s{
    char rowBP[512];
};

struct sdbootsec_s{
    int secSt;              // status of boot sector 
    int secJpcmd;      // jump command to the boot program
    char secSysid[8];
    int secSize;          // 512
    int secPrClst;       // 4 8 16 32 64
    int secResv;        // M 
    int secNfat;         // should be 2
    int secTotal;        // total sectors
    int secIDm;         // must be 0xF8
    int secPrfat;         // sectors per FAT
    int secPrtrk;         // sectors per track
    int secNsid;          // number of sides
    int secNhid;          // number of hidden sectors
    int secExtf;           // extension flag, specify the status of FAT mirroring
    int secVers;          // File system version
    int secRtclst;        // indicate the cluster number of root dir
    int secFSif;           // indicate the sector number of FS info, will be 1 normally
    int secBkbt;          // indicate the offset sector number of backup boot sector
    int secPhdk;         // pyhsical disk number, should be 0x80
    int secExtbt;        // extended boot record signature, should be 0x29
    int secVoid;          // volume ID number
    char secVola[12]; // volume label
    char secFtyp[12];   // file system type in ascii
    int secSign;          // shall be 0x55 (BP510) and 0xAA (BP511)
    int secWhfat;        // indicate the sector of fat table
    int secWhroot;      // indicate the sector of root dir
    int secBoffset;
};

struct sdFSinfo_s{
    int finLdsn;            // lead ingnature, shall be 0x52 0x52 0x61 0x41
    int finStsn;             // structure signature, shall be 0x72 0x72 0x41 0x61
    int finFreClst;        // free cluster count
    int finNxtFreClst;   // next free cluster
    int finTrsn;             // shall be 0x00 0x00 0x55 0xaa
};

struct adFATSpaceInfo_s{
    uint32_t  ftfreeClst;
    uint32_t  ftusedClst;
    struct adFATLinkList_s *f;    
};

struct adFATLinkList_s{
    uint32_t ftStart;              // start cluster
    uint32_t ftLen;                // cluster length
    struct adFATLinkList_s *n;    
};

struct sdFATable_s{
    uint8_t *ftbFat1;
    uint32_t ftbLen;
    struct adFATLinkList_s *h;
    struct adFATLinkList_s *c;
    struct adFATSpaceInfo_s ftbMng;
};

struct sdParseBuff_s{
    int dirBuffMax;
    int dirBuffUsed;
    char *dirParseBuff;
};

struct sdDirPool_s{
    int dirMax;
    int dirUsed;
    struct directnFile_s   dirPool[FAT_DIRPOOL_IDX_MAX];
};

struct sdFatDir_s{
    int dirFATMax;
    int dirFATUsed;
    int dirFATDirty;
    struct sdDirPool_s      *fatDirPool[FAT_DIRPOO_ARY_MAX];
    struct directnFile_s     *dirCur;
    struct directnFile_s     *dirRoot;
};

struct sdFatFormat_s{
    uint32_t fmtTotSector;
    uint32_t fmtHidnSector;
    uint32_t fmtSectorPerCls;
    struct sdbootsec_s     fmtBootsec;
    struct sdFSinfo_s       fmtInfosec;
};

struct sdFAT_s{
    int fatStatus;
    int fatRetry;
    struct directnFile_s     fatFileDnld;
    struct directnFile_s     fatFileUpld;
    struct directnFile_s     fatFolderCrt;
    struct directnFile_s     fatCurDir;
    struct directnFile_s     fatRootdir;
    struct sdbootsec_s     fatBootsec;
    struct sdFSinfo_s       fatFSinfo;
    struct sdFATable_s     fatTable;
    struct sdFatDir_s         fatDirTr;
    struct sdParseBuff_s  parBuf;
    struct supdataBack_s    *fatSupdata;
    struct supdataBack_s    *fatSupcur;
    struct supdataBack_s    *fatSupdataDuo;
    struct supdataBack_s    *fatSupcurDuo;
    struct sdFatFormat_s     fatFormat;
};

struct psdata_s {
    uint32_t bkofw;
    uint32_t result;
    uint32_t ansp0;
    struct procRes_s *rs;
};

typedef int (*stfunc)(struct psdata_s *data);

struct logPool_s{
    char *pool;
    char *cur;
    int max;
    int len;
    uint32_t dislog;
};

struct cmd_s{
    int  id;
    char str[16];
    func pfunc;
};

struct ring_s{
    int run;
    int seq;
};

struct ring_p{
    struct ring_s lead;
    struct ring_s dual;
    struct ring_s prelead;
    struct ring_s predual;
    struct ring_s folw;
    struct ring_s psudo;
    struct ring_s *usbrunnig;
    struct ring_s *usbgettig;
};

struct socket_s{
    int listenfd;
    int connfd;
    struct sockaddr_in serv_addr; 
    struct sockaddr_in clint_addr; 
    struct addrinfo addr_in;
};

struct shmem_s{
    int totsz;
    int chksz;
    int slotn;
    char **pp;
    int svdist;
    struct ring_p *r;
    int lastflg;
    int lastsz;
    int dualsz;
    int *urun;
    int *uget;
};

struct modersp_s{
    int m;
    int r;
    int d;
    int v;  
    int c;
    int t;
};

struct info16Bit_s{
    uint8_t     inout;
    uint8_t     seqnum;
    uint8_t     opcode;
    uint8_t     data;
    uint32_t   opinfo;
};

struct machineCtrl_s{
    uint32_t seqcnt;
    struct info16Bit_s poll;
    struct info16Bit_s tmp;
    struct info16Bit_s cur;
    struct info16Bit_s get;
    struct info16Bit_s ubs;
    struct modersp_s mch;
    char mshmem[SPI_TRUNK_SZ];
};

struct intMbs_s{
    union {
        uint32_t n;
        uint8_t d[4];
    };
};

struct aspMetaData_s{
  struct intMbs_s     FUNC_BITS;             // byte[4] 
  unsigned char  ASP_MAGIC[2];            //byte[6] "0x20 0x14"
  
  /* ASPMETA_FUNC_CONF = 0x1 */       /* 0b00000001 */
  unsigned char  FILE_FORMAT;             //0x31
  unsigned char  COLOR_MODE;              //0x32
  unsigned char  COMPRESSION_RATE;        //0x33
  unsigned char  RESOLUTION;              //0x34
  unsigned char  SCAN_GRAVITY;            //0x35
  unsigned char  CIS_MAX_WIDTH;           //0x36
  unsigned char  WIDTH_ADJUST_H;          //0x37
  unsigned char  WIDTH_ADJUST_L;          //0x38
  unsigned char  SCAN_LENGTH_H;           //0x39
  unsigned char  SCAN_LENGTH_L;           //0x3a
  unsigned char  INTERNAL_IMG;             //0x3b
  unsigned char  AFE_IC_SELEC;             //0x3c
  unsigned char  EXTNAL_PULSE;            //0x3d
  unsigned char  SUP_WRITEBK;             //0x3e
  unsigned char  OP_FUNC_00;               //0x70
  unsigned char  OP_FUNC_01;               //0x71
  unsigned char  OP_FUNC_02;               //0x72
  unsigned char  OP_FUNC_03;               //0x73
  unsigned char  OP_FUNC_04;               //0x74
  unsigned char  OP_FUNC_05;               //0x75
  unsigned char  OP_FUNC_06;               //0x76
  unsigned char  OP_FUNC_07;               //0x77
  unsigned char  OP_FUNC_08;               //0x78
  unsigned char  OP_FUNC_09;               //0x79
  unsigned char  OP_FUNC_10;               //0x7A
  unsigned char  OP_FUNC_11;               //0x7B
  unsigned char  OP_FUNC_12;               //0x7C
  unsigned char  OP_FUNC_13;               //0x7D
  unsigned char  OP_FUNC_14;               //0x7E
  unsigned char  OP_FUNC_15;               //0x7F  
  unsigned char  BLEEDTHROU_ADJUST; //0x81
  unsigned char  BLACKWHITE_THSHLD; //0x82  
  unsigned char  SD_CLK_RATE_16;        //0x83    
  unsigned char  PAPER_SIZE;                //0x84  
  unsigned char  JPGRATE_ENG_17;       //0x85  
  unsigned char  OP_FUNC_18;               //0x86  
  unsigned char  OP_FUNC_19;               //0x87  
  unsigned char  OP_FUNC_20;               //0x88  
  unsigned char  OP_FUNC_21;               //0x89  
  unsigned char  OP_FUNC_22;               //0x8a
  unsigned char  OP_RESERVE[18];          // byte[64]
  
  /* ASPMETA_FUNC_CROP = 0x2 */       /* 0b00000010 */
  struct intMbs_s CROP_POS_1;        //byte[68]
  struct intMbs_s CROP_POS_2;        //byte[72]
  struct intMbs_s CROP_POS_3;        //byte[76]
  struct intMbs_s CROP_POS_4;        //byte[80]
  struct intMbs_s CROP_POS_5;        //byte[84]
  struct intMbs_s CROP_POS_6;        //byte[88]
  struct intMbs_s CROP_POS_7;        //byte[92]
  struct intMbs_s CROP_POS_8;        //byte[96]
  struct intMbs_s CROP_POS_9;        //byte[100]
  struct intMbs_s CROP_POS_10;        //byte[104]
  struct intMbs_s CROP_POS_11;        //byte[108]
  struct intMbs_s CROP_POS_12;        //byte[112]
  struct intMbs_s CROP_POS_13;        //byte[116]
  struct intMbs_s CROP_POS_14;        //byte[120]
  struct intMbs_s CROP_POS_15;        //byte[124]
  struct intMbs_s CROP_POS_16;        //byte[128]
  struct intMbs_s CROP_POS_17;        //byte[132]
  struct intMbs_s CROP_POS_18;        //byte[136]
  unsigned char  Start_Pos_1st;         //byte[137]
  unsigned char  Start_Pos_2nd;        //byte[138]
  unsigned char  End_Pos_All;            //byte[139]
  unsigned char  Start_Pos_RSV;        //byte[140], not using for now
  unsigned char  YLine_Gap;               //byte[141]
  unsigned char  Start_YLine_No;       //byte[142]
  unsigned short YLines_Recorded;     //byte[144] 16bits
  unsigned char CROP_RESERVE[16]; //byte[160]

  /* ASPMETA_FUNC_IMGLEN = 0x4 */     /* 0b00000100 */
  struct intMbs_s SCAN_IMAGE_LEN;     //byte[164]
  
  /* ASPMETA_FUNC_SDFREE = 0x8 */     /* 0b00001000 */
  struct intMbs_s  FREE_SECTOR_ADD;   //byte[168]
  struct intMbs_s  FREE_SECTOR_LEN;   //byte[172]
  
  /* ASPMETA_FUNC_SDUSED = 0x16 */    /* 0b00010000 */
  struct intMbs_s  USED_SECTOR_ADD;   //byte[176]
  struct intMbs_s  USED_SECTOR_LEN;   //byte[180]
  
  /* ASPMETA_FUNC_SDRD = 0x32 */      /* 0b00100000 */
  /* ASPMETA_FUNC_SDWT = 0x64 */      /* 0b01000000 */
  struct intMbs_s  SD_RW_SECTOR_ADD;  //byte[184]
  struct intMbs_s  SD_RW_SECTOR_LEN;  //byte[188]
  
  unsigned char available[324];
};

struct aspMetaDataviaUSB_s{
  unsigned char  ASP_MAGIC_ASPC[4];  //byte[4] "ASPC"
  unsigned char IMG_HIGH[2];                   // byte[6] 
  unsigned char  WIDTH_RESERVE[5];    // byte[11]
  unsigned char IMG_WIDTH[2];                // byte[13]
  unsigned char  MCROP_RESERVE[51];   // byte[64]
  
  struct intMbs_s CROP_POS_1;        //byte[68]
  struct intMbs_s CROP_POS_2;        //byte[72]
  struct intMbs_s CROP_POS_3;        //byte[76]
  struct intMbs_s CROP_POS_4;        //byte[80]
  struct intMbs_s CROP_POS_5;        //byte[84]
  struct intMbs_s CROP_POS_6;        //byte[88]
  struct intMbs_s CROP_POS_7;        //byte[92]
  struct intMbs_s CROP_POS_8;        //byte[96]
  struct intMbs_s CROP_POS_9;        //byte[100]
  struct intMbs_s CROP_POS_10;        //byte[104]
  struct intMbs_s CROP_POS_11;        //byte[108]
  struct intMbs_s CROP_POS_12;        //byte[112]
  struct intMbs_s CROP_POS_13;        //byte[116]
  struct intMbs_s CROP_POS_14;        //byte[120]
  struct intMbs_s CROP_POS_15;        //byte[124]
  struct intMbs_s CROP_POS_16;        //byte[128]
  struct intMbs_s CROP_POS_17;        //byte[132]
  struct intMbs_s CROP_POS_18;        //byte[136]
  unsigned char  Start_Pos_1st;         //byte[137]
  unsigned char  Start_Pos_2nd;        //byte[138]
  unsigned char  End_Pos_All;            //byte[139]
  unsigned char  Start_Pos_RSV;        //byte[140], not using for now
  unsigned char  YLine_Gap;               //byte[141]
  unsigned char  Start_YLine_No;       //byte[142]
  unsigned short YLines_Recorded;     //byte[144] 16bits
  unsigned char EPOINT_RESERVE0[16];         //byte[160]
  unsigned char EPOINT_RESERVE1[64];         //byte[224]
  unsigned char ASP_MAGIC_YL[2];    //byte[226]
  unsigned short MPIONT_LEN;           //byte[228] 16bits  
  unsigned char EXTRA_POINT[4];    //byte[232]
};

struct aspMetaMass_s{
    int massUsed;
    int massMax;
    int massGap;
    int massRecd;
    int massStart;
    char *masspt;
};

struct aspCrop36_s{
    uint32_t crp36Flag;
    CFLOAT crp36Pots[40];
    CFLOAT crp36LineUpbnd[3];
    CFLOAT crp36LineTop[3];
    CFLOAT crp36LineBotn[3];
    CFLOAT crp36LineRight[3];
    CFLOAT crp36LineLeft[3];
    int crp36Up;
    int crp36Dn;
    int crp36Rt;
    int crp36Lf;
    CFLOAT crp36CsUp[2];
    CFLOAT crp36CsDn[2];
    CFLOAT crp36MsLf[2];
    CFLOAT crp36MsRt[2];
    CFLOAT crp36AngleUp;
    CFLOAT crp36AngleDn;
    CFLOAT crp36AngleLf;
    CFLOAT crp36AngleRt;
    CFLOAT crp36CsLineLU[3];
    CFLOAT crp36CsLineRU[3];    
    CFLOAT crp36CsLineLD[3];
    CFLOAT crp36CsLineRD[3];    
    CFLOAT crp36P1[2];
    CFLOAT crp36P2[2];
    CFLOAT crp36P3[2];
    CFLOAT crp36P4[2];
};

struct aspCropExtra_s{
    int crpexMax;
    int crpexSize;
    CFLOAT crpexLfPots[2048];
    CFLOAT crpexRtPots[2048];
    int crpexLfAbs[2048];
    int crpexLfAbsUsed;
    int crpexLfAbsCut;
    int crpexLfAbsMax;
    int crpexRtAbs[2048];
    int crpexRtAbsUsed;
    int crpexRtAbsCut;
    int crpexRtAbsMax;
    CFLOAT crpexCrosUp[2];
    CFLOAT crpexCrosDn[2];
    CFLOAT crpexMostLt[2];
    CFLOAT crpexMostRt[2];
    CFLOAT *crpexGrpLUpt;
    CFLOAT *crpexGrpLDpt;
    CFLOAT *crpexGrpRUpt;
    CFLOAT *crpexGrpRDpt;
    int crpexGrpLUStr;
    int crpexGrpLDStr;
    int crpexGrpRUStr;
    int crpexGrpRDStr;
    int crpexGrpLULen;
    int crpexGrpLDLen;
    int crpexGrpRULen;
    int crpexGrpRDLen;
    CFLOAT crpexLinLU[3];
    CFLOAT crpexLinLD[3];
    CFLOAT crpexLinRU[3];
    CFLOAT crpexLinRD[3];
    int crpexLinLUDiv;
    int crpexLinLDDiv;
    int crpexLinRUDiv;
    int crpexLinRDDiv;
    CFLOAT crpCropUp[2];
    CFLOAT crpCropDn[2];
    CFLOAT crpCropLf[2];
    CFLOAT crpCropRt[2];
};

struct bitmapHeader_s {
    char aspbmpMagic[4];
    int    aspbhSize;
    char aspbhReserve[4];
    int    aspbhRawoffset;
    int    aspbiSize;
    int    aspbiWidth;
    int    aspbiHeight;
    int    aspbiCPP;
    int    aspbiCompMethd;
    int    aspbiRawSize;
    int    aspbiResoluH;
    int    aspbiResoluV;
    int    aspbiNumCinCP;
    int    aspbiNumImpColor;
};

struct bitmapRotate_s {
    char *aspRotCrossAry;
    int aspRotCASize;
    char *aspRotCpyBuff;
    int aspRotBuffSize;
};

struct usbCBWopc_s{
		struct intMbs_s 	opcID; 			// 0x55534243 
		struct intMbs_s 	opcTag;			// sent by host , and device will send it back in CSW
		struct intMbs_s 	opcDataLength;	// data length between CBW and CSW , 0 = no data 
		uint8_t	              opcreserved0[3];	// 3 byte reserved
		uint8_t 	              opcType;		// refer to section 2.1
		uint8_t	              opcOpcode;		// opcode 	, refer to section 4
		uint8_t	              opcSubOPCode;	// sub opcode , refer to section 4
		uint8_t	              opcParameter;	// parameter , refer to section 4
		uint8_t	              opcreserved1[12]; 	// 12 byte reserved
};

struct usbCBWpram_s{
		struct intMbs_s 	pramID; 			// 0x55534243 
		struct intMbs_s 	pramTag;			// sent by host , and device will send it back in CSW
		struct intMbs_s 	pramDataLength;	// data length between CBW and CSW , 0 = no data 
		uint8_t	              pramreserved0[3];	// 3 byte reserved
		uint8_t 	              pramType;		// 0x00 ~ 0x0F = Programmer OPCode
		struct intMbs_s	pramAddress;		// forward to MCU
		uint8_t	              pramreserved1[8]; 	// forward to MCU
		uint8_t	              ASIC_sel; 	             //  0=Primary ASIC , 1=Secondary ASIC
		uint8_t	              cs; 	                           // forward to MCU
		uint8_t	              pramDirect;		// 1=output (BULK OUT), 2=input (BULK IN), 0=no data
};

struct usbhost_s{
    int ushid;
    struct shmem_s *pushring;
    struct shmem_s *pgatring;
    char *puhsmeta;
    int *pushrx;
    int *pushtx;
    int *pgatrx;
    int *pgattx;
    int pushcnt;
    int pushrmcnt;
    int pushcswerr;
    
    uint32_t *pushvaddrtb;
};

struct usbHostmem_s {
    char         *ushostname;
    int            ushostid;
    uint32_t  *ushostblvir;
    uint32_t  *ushostblphy;
    int            ushostbmax;
    int            ushostbthrshold;
    int            ushostbtrktot;
    int            ushostbtrkcms;
